tutorials/neoIcoFoam/stretchedVortexCylinder/0.orig/U
FoamFile { version 2.0; format ascii; class volVectorField; object U; }
dimensions      [0 1 -1 0 0 0 0];
// Placeholders; setExprFields overwrites the internal field and
// setExprBoundaryFields overwrites all three patches (see Allrun).
internalField   uniform (0 0 0);
boundaryField
{
    side   { type fixedValue; value uniform (0 0 0); }
    top    { type fixedValue; value uniform (0 0 0); }
    bottom { type fixedValue; value uniform (0 0 0); }
}
