tutorials/neoIcoFoam/stretchedVortexCylinder/0.orig/p
FoamFile { version 2.0; format ascii; class volScalarField; object p; }
dimensions      [0 2 -2 0 0 0 0];
// U is prescribed on every patch, so p is defined only up to a constant and is
// Neumann everywhere; the level is pinned by pRefCell/pRefValue in fvSolution.
internalField   uniform 0;
boundaryField
{
    side   { type zeroGradient; }
    top    { type zeroGradient; }
    bottom { type zeroGradient; }
}
